ericsonj/qemu-pic32mk/tests/pic32mk_rtos_demo/firmware/src/main.c
static QueueHandle_t xUart2RxQueue;

static void uart2_rx_callback(UART_EVENT event, uintptr_t context)
{
    (void)context;
    if (event != UART_EVENT_READ_THRESHOLD_REACHED)
    {
        return;
    }

    uint8_t byte;
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;

    while (UART2_Read(&byte, 1) == 1)
    {
        xQueueSendToBackFromISR(xUart2RxQueue, &byte, &xHigherPriorityTaskWoken);
    }
    /* Yield is handled by portRESTORE_CONTEXT in vUART2RXInterruptWrapper */
}

/* -----------------------------------------------------------------------
 * UART2 consumer task
 *
 * Blocks on the queue until a byte arrives, then echoes it on UART1
 * as: "[U2] <hex> '<ch>'\r\n"
 * ----------------------------------------------------------------------- */

static void uart1_puthex(uint8_t v)
{
    const char hex[] = "0123456789ABCDEF";
    uart1_putc(hex[v >> 4]);
    uart1_putc(hex[v & 0xFu]);
}

static void vUart2ConsumerTask(void *pvParam)
{
    (void)pvParam;
    for (;;)
    {
        uint8_t byte;
        if (xQueueReceive(xUart2RxQueue, &byte, portMAX_DELAY) == pdTRUE)
        {
            uart1_puts("[U2] 0x");
            uart1_puthex(byte);
            uart1_puts(" '");
            uart1_putc((char)byte);
            uart1_puts("'\r\n");
        }
    }
}

/* -----------------------------------------------------------------------
 * USB CDC TX task
 *
 * Waits 3 s for USB enumeration, then sends "[CDC] Hello #N\r\n" every
 * second.  Uses USB_SendFrame() which is non-blocking.
 * ----------------------------------------------------------------------- */

static void vUsbCdcTask(void *pvParam)
{
    (void)pvParam;
    static uint8_t s_buf[48];
    uint32_t count = 0;

    /* Wait for host to enumerate the device */
    vTaskDelay(pdMS_TO_TICKS(3000));

    for (;;)
    {
        const char prefix[] = "[CDC] Hello #";
        const char suffix[] = "\r\n";
        uint8_t tmp[12];
        uint32_t val;
        int n;

        count++;

        /* Build message manually — no printf/snprintf available */
        uint8_t *p = s_buf;
        const char *c;
        for (c = prefix; *c; c++)
            *p++ = (uint8_t)*c;

        /* Decimal count */
        val = count;
        n = 0;
        if (val == 0U)
        {
            tmp[n++] = '0';
        }
        else
        {
            while (val)
            {
                tmp[n++] = (uint8_t)('0' + val % 10);
                val /= 10;
            }
            /* reverse */
            {
                int l = 0, r = n - 1;
                while (l < r)
                {
                    uint8_t t = tmp[l];
                    tmp[l] = tmp[r];
                    tmp[r] = t;
                    l++;
                    r--;
                }
            }
        }
        {
            int i;
            for (i = 0; i < n; i++)
                *p++ = tmp[i];
        }
        for (c = suffix; *c; c++)
            *p++ = (uint8_t)*c;

        /* Retry until accepted (USB may still be busy from previous TX) */
        {
            size_t len = (size_t)(p - s_buf);
            while (!USB_SendFrame(s_buf, len))
            {
                vTaskDelay(pdMS_TO_TICKS(10));
            }
        }

        vTaskDelay(pdMS_TO_TICKS(1000));
    }
}

/* -----------------------------------------------------------------------
 * GPIO Port A tasks
 *
 * Pin assignment from plib_gpio.h (VOLTU hardware):
 *   RA15 (GPO_GND_DIFF_LOCK) — digital output, configured by GPIO_Initialize()
 *   RA7  (SPI_EN)            — digital input with CN, configured by GPIO_Initialize()
 *
 * vGpioBlinkTask   — toggles RA15 every 500 ms
 * vGpioMonitorTask — waits for CN interrupt on RA7, prints state change
 *
 * Host-side workflow (requires QEMU launched with -qmp socket):
 *   python3 gpio_tool.py --qmp /tmp/qemu-qmp.sock set A 7 1
 *   python3 gpio_tool.py --qmp /tmp/qemu-qmp.sock set A 7 0
 *   python3 gpio_tool.py --qmp /tmp/qemu-qmp.sock get-port A
 * ----------------------------------------------------------------------- */

static SemaphoreHandle_t xGpioCnSemaphore;

static void gpio_ra7_callback(GPIO_PIN pin, uintptr_t context)
{
    (void)pin;
    (void)context;
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;
    xSemaphoreGiveFromISR(xGpioCnSemaphore, &xHigherPriorityTaskWoken);
}

static void vGpioBlinkTask(void *pvParam)
{
    (void)pvParam;

    /* RA15 (GPO_GND_DIFF_LOCK): configured as digital output by GPIO_Initialize()
     * (ANSELACLR = 0xd803 clears bit 15, TRISACLR = 0xc401 clears bit 15) */
    uart1_puts("[GPIO] RA15 blink started (500ms toggle)\r\n");

    for (;;)
    {
        GPO_GND_DIFF_LOCK_Toggle();
        vTaskDelay(pdMS_TO_TICKS(50));
    }
}

static void vGpioMonitorTask(void *pvParam)
{
    (void)pvParam;
    uint8_t prev_ra7 = 0;

    /* RA7 (SPI_EN): input-only pin on port A.
     * GPIO_Initialize() already enabled CNCON.ON and IEC1.CNAIE.
     * We just register the callback and enable per-pin CN detection. */
    xGpioCnSemaphore = xSemaphoreCreateBinary();
    GPIO_PinInterruptCallbackRegister(SPI_EN_PIN, gpio_ra7_callback, 0);
    GPIO_PinIntEnable(SPI_EN_PIN, GPIO_INTERRUPT_ON_BOTH_EDGES);

    uart1_puts("[GPIO] RA7 (SPI_EN) CN interrupt monitor started\r\n");
    uart1_puts("[GPIO] Inject: gpio_tool.py set A 7 1\r\n");

    for (;;)
    {
        xSemaphoreTake(xGpioCnSemaphore, portMAX_DELAY);

        uint8_t ra7 = (uint8_t)SPI_EN_Get();

        if (ra7 != prev_ra7)
        {
            if (ra7)
            {
                uart1_puts("[GPIO] RA7: LOW -> HIGH (rising edge)\r\n");
            }
            else
            {
                uart1_puts("[GPIO] RA7: HIGH -> LOW (falling edge)\r\n");
            }
            prev_ra7 = ra7;
        }
    }
}

/* -----------------------------------------------------------------------
 * ADC Monitor task — reads CH15 (TEMP_MOTOR) via EOS interrupt
 * ----------------------------------------------------------------------- */

static SemaphoreHandle_t xAdcEosSemaphore;

