ericsonj/qemu-pic32mk/tests/pic32mk_rtos_demo/firmware/src/main.c
static void adc_eos_callback(uintptr_t context)
{
    (void)context;
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;
    xSemaphoreGiveFromISR(xAdcEosSemaphore, &xHigherPriorityTaskWoken);
}

static void vAdcMonitorTask(void *pvParam)
{
    (void)pvParam;

    xAdcEosSemaphore = xSemaphoreCreateBinary();
    ADCHS_EOSCallbackRegister(adc_eos_callback, 0);

    uart1_puts("[ADC] CH15 (TEMP_MOTOR) monitor started\r\n");
    uart1_puts("[ADC] Inject: gpio_tool.py adc-set 15 2048\r\n");

    for (;;)
    {
        /* Trigger a global software edge conversion */
        ADCHS_GlobalEdgeConversionStart();

        /* Wait for End-of-Scan interrupt */
        xSemaphoreTake(xAdcEosSemaphore, portMAX_DELAY);

        /* Read channel 15 result */
        if (ADCHS_ChannelResultIsReady(ADCHS_CH15))
        {
            uint32_t result = ADCHS_ChannelResultGet(ADCHS_CH15);
            uart1_puts("[ADC] CH15 = ");
            uart1_putu(result);
            uart1_puts("\r\n");
        }

        vTaskDelay(pdMS_TO_TICKS(10000));
    }
}

/* -----------------------------------------------------------------------
 * EEPROM Test task — exercises Data EEPROM via Harmony plib
 *
 * Sequence: init -> write 4 words -> read back & verify -> page erase ->
 *           verify erased -> bulk erase -> done.
 * Prints PASS/FAIL for each step.
 * ----------------------------------------------------------------------- */

static void uart1_puthex32(uint32_t v)
{
    int i;
    for (i = 28; i >= 0; i -= 4) {
        uart1_puthex((uint8_t)((v >> i) & 0xFu));
    }
}

static void vEepromTestTask(void *pvParam)
{
    (void)pvParam;

    uart1_puts("[EE] EEPROM test starting...\r\n");

    /* --- Write 4 words at addresses 0x000, 0x004, 0x008, 0x00C --- */
    static const uint32_t test_addr[] = { 0x000, 0x004, 0x008, 0x00C };
    static const uint32_t test_data[] = { 0xDEADBEEF, 0xCAFEBABE, 0x12345678, 0xA5A5A5A5 };
    uint32_t i;
    bool ok;

    for (i = 0; i < 4; i++) {
        ok = EEPROM_WordWrite(test_addr[i], test_data[i]);
        if (!ok) {
            uart1_puts("[EE] FAIL: WordWrite addr=0x");
            uart1_puthex32(test_addr[i]);
            uart1_puts("\r\n");
        }
    }

    EEPROM_ERROR err = EEPROM_ErrorGet();
    if (err != EEPROM_ERROR_NONE) {
        uart1_puts("[EE] FAIL: ErrorGet after writes = 0x");
        uart1_puthex32(err);
        uart1_puts("\r\n");
    }

    /* --- Read back and verify --- */
    uint32_t pass_count = 0;
    for (i = 0; i < 4; i++) {
        uint32_t readback = 0;
        ok = EEPROM_WordRead(test_addr[i], &readback);
        if (!ok) {
            uart1_puts("[EE] FAIL: WordRead addr=0x");
            uart1_puthex32(test_addr[i]);
            uart1_puts("\r\n");
        } else if (readback != test_data[i]) {
            uart1_puts("[EE] FAIL: addr=0x");
            uart1_puthex32(test_addr[i]);
            uart1_puts(" expected=0x");
            uart1_puthex32(test_data[i]);
            uart1_puts(" got=0x");
            uart1_puthex32(readback);
            uart1_puts("\r\n");
        } else {
            pass_count++;
        }
    }
    uart1_puts("[EE] Write/Read: ");
    uart1_putu(pass_count);
    uart1_puts("/4 PASS\r\n");


    /* --- Page erase (page 0 = addresses 0x000..0x07C) --- */
    ok = EEPROM_PageErase(0x000);
    if (!ok) {
        uart1_puts("[EE] FAIL: PageErase\r\n");
    }
    /* Verify erased (should read 0xFFFFFFFF) */
    pass_count = 0;
    for (i = 0; i < 4; i++) {
        uint32_t readback = 0;
        ok = EEPROM_WordRead(test_addr[i], &readback);
        if (ok && readback == 0xFFFFFFFFu) {
            pass_count++;
        } else {
            uart1_puts("[EE] FAIL: post-erase addr=0x");
            uart1_puthex32(test_addr[i]);
            uart1_puts(" got=0x");
            uart1_puthex32(readback);
            uart1_puts("\r\n");
        }
    }
    uart1_puts("[EE] PageErase: ");
    uart1_putu(pass_count);
    uart1_puts("/4 PASS\r\n");

    /* --- Bulk erase test: write one word, bulk erase, verify --- */
    EEPROM_WordWrite(0x100, 0xBAADF00Du);
    ok = EEPROM_BulkErase();
    if (!ok) {
        uart1_puts("[EE] FAIL: BulkErase\r\n");
    }
    {
        uint32_t readback = 0;
        EEPROM_WordRead(0x100, &readback);
        if (readback == 0xFFFFFFFFu) {
            uart1_puts("[EE] BulkErase: PASS\r\n");
        } else {
            uart1_puts("[EE] BulkErase: FAIL got=0x");
            uart1_puthex32(readback);
            uart1_puts("\r\n");
        }
    }

    uart1_puts("[EE] EEPROM test complete.\r\n");

    /* Task done — suspend forever */
    vTaskSuspend(NULL);
}

/* -----------------------------------------------------------------------
 * NVM (Program Flash) Test task — uses Harmony plib API
 *
 * Exercises the QEMU NVM controller via the unmodified Harmony plib
 * (NVM_WordWrite, NVM_QuadWordWrite, NVM_PageErase, NVM_Read).
 * The plib enables IEC0[31] after each operation; the NVM ISR
 * (NVM_InterruptHandler) clears IFS0[31] so FreeRTOS keeps running.
 *
 * Test sequence: word write ×4 -> read back -> quad-word write ->
 *                read back -> page erase -> verify erased.
 * Uses the last page of program flash (NVM_FLASH_START_ADDRESS + 0xFF000).
 * ----------------------------------------------------------------------- */

static void vNvmTestTask(void *pvParam)
{
    (void)pvParam;

    const uint32_t test_base = NVM_FLASH_START_ADDRESS + 0xFF000u;

    uart1_puts("[NVM] NVM test starting...\r\n");

    /* --- Word write ×4 --- */
    static const uint32_t test_data[] = {
        0xDEADBEEFu, 0xCAFEBABEu, 0x12345678u, 0xA5A5A5A5u
    };
    uint32_t i;

    for (i = 0; i < 4; i++) {
        NVM_WordWrite(test_data[i], test_base + i * 4u);
        while (NVM_IsBusy()) { }
    }

    if (NVM_ErrorGet() != NVM_ERROR_NONE) {
        uart1_puts("[NVM] FAIL: error after writes = 0x");
        uart1_puthex32(NVM_ErrorGet());
        uart1_puts("\r\n");
    }

    /* --- Read back via NVM_Read and verify --- */
    uint32_t rbuf[4];
    NVM_Read(rbuf, sizeof(rbuf), test_base);

    uint32_t pass_count = 0;
    for (i = 0; i < 4; i++) {
        if (rbuf[i] != test_data[i]) {
            uart1_puts("[NVM] FAIL: word[");
            uart1_putu(i);
            uart1_puts("] expected=0x");
            uart1_puthex32(test_data[i]);
            uart1_puts(" got=0x");
            uart1_puthex32(rbuf[i]);
            uart1_puts("\r\n");
        } else {
            pass_count++;
        }
    }
    uart1_puts("[NVM] Write/Read: ");
    uart1_putu(pass_count);
    uart1_puts("/4 PASS\r\n");

