ericsonj/qemu-pic32mk/tests/pic32mk_rtos_demo/firmware/src/main.c
    uart1_puts("PIC32MK QEMU booting FreeRTOS...\r\n");
    uart1_puts("UART2 RX -> FreeRTOS queue -> consumer task\r\n");
    uart1_puts("SPI5 slave ready on chardev 'spi5'\r\n");

    /* Queue for CAN1 RX frames (depth = 16) */
    xCan1RxQueue = xQueueCreate(16, sizeof(CAN1Frame_t));
    CAN1_CallbackRegister(can1_rx_callback, 0, 2U); /* FIFO2 = RX */
    CAN1_MessageReceive(&can1_rx_id, &can1_rx_len, can1_rx_data,
                        &can1_rx_ts, 2U, &can1_rx_attr);

    /* Queue for CAN2 RX frames (depth = 16) */
    xCan2RxQueue = xQueueCreate(16, sizeof(CAN2Frame_t));
    CAN2_CallbackRegister(can2_rx_callback, 0, 2U); /* FIFO2 = RX */
    CAN2_MessageReceive(&can2_rx_id, &can2_rx_len, can2_rx_data,
                        &can2_rx_ts, 2U, &can2_rx_attr);

    /* Queue for bytes received on UART2 (depth = 64 bytes) */
    xUart2RxQueue = xQueueCreate(64, sizeof(uint8_t));

    /* Register UART2 RX callback: notify per byte, non-persistent */
    UART2_ReadCallbackRegister(uart2_rx_callback, 0);
    UART2_ReadThresholdSet(10);
    UART2_ReadNotificationEnable(true, false);

    xTaskCreate(vHelloTask, "Hello", configMINIMAL_STACK_SIZE,
                NULL, tskIDLE_PRIORITY + 1, NULL);
    xTaskCreate(vPingTask, "Ping", configMINIMAL_STACK_SIZE,
                NULL, tskIDLE_PRIORITY + 1, NULL);
    xTaskCreate(vUart2ConsumerTask, "U2Rx", configMINIMAL_STACK_SIZE,
                NULL, tskIDLE_PRIORITY + 2, NULL); /* higher priority so it runs immediately */
    xTaskCreate(vCanTxTask, "CAN", configMINIMAL_STACK_SIZE * 2,
                NULL, tskIDLE_PRIORITY + 1, NULL);
    xTaskCreate(vCan1RxTask, "C1Rx", configMINIMAL_STACK_SIZE,
                NULL, tskIDLE_PRIORITY + 2, NULL);
    xTaskCreate(vCan2RxTask, "C2Rx", configMINIMAL_STACK_SIZE,
                NULL, tskIDLE_PRIORITY + 2, NULL);
    xTaskCreate(vUsbDeviceTask, "USB", 512,
                NULL, tskIDLE_PRIORITY + 1, NULL);
    xTaskCreate(vUsbCdcTask, "CDC", configMINIMAL_STACK_SIZE * 2,
                NULL, tskIDLE_PRIORITY + 1, NULL);
    xTaskCreate(vGpioBlinkTask, "Blink", configMINIMAL_STACK_SIZE,
                NULL, tskIDLE_PRIORITY + 1, NULL);
    xTaskCreate(vGpioMonitorTask, "GpioMon", configMINIMAL_STACK_SIZE,
                NULL, tskIDLE_PRIORITY + 2, NULL);
    xTaskCreate(vAdcMonitorTask, "ADC", configMINIMAL_STACK_SIZE,
                NULL, tskIDLE_PRIORITY + 1, NULL);
    xTaskCreate(vEepromTestTask, "EE", configMINIMAL_STACK_SIZE * 2,
                NULL, tskIDLE_PRIORITY + 1, NULL);
    xTaskCreate(vNvmTestTask, "NVM", configMINIMAL_STACK_SIZE * 2,
                NULL, tskIDLE_PRIORITY + 1, NULL);
    xTaskCreate(vOcDemoTask, "OC", configMINIMAL_STACK_SIZE,
                NULL, tskIDLE_PRIORITY + 1, NULL);
    xTaskCreate(vIcapDemoTask, "ICAP", configMINIMAL_STACK_SIZE,
                NULL, tskIDLE_PRIORITY + 1, NULL);
    xTaskCreate(vSpi5SlaveTask, "SPI5", configMINIMAL_STACK_SIZE,
                NULL, tskIDLE_PRIORITY + 1, NULL);

    vTaskStartScheduler();

    /* Should never reach here */
    uart1_puts("ERROR: scheduler returned\r\n");
    for (;;)
    {
    }
}
